# CRUD - Create Read Update Delete

# HTTP - HyperText Transfer Protocol - набор правил для общения между серверами

# GET - Read
# POST - Create
# PUT/PATCH - Update/Partial Update
# DELETE - Delete

# Клиент - программа, которая отправляет запросы на сервер (браузер)
# Сервер - программа, которая принимает запросы, обрабатывает их и отдает ответ клиенту (бэкенд приложение)

# Запрос - обращение к серверу

# HOST - имя сервера. Например: 'lalafo.kg'
# URI - путь до ресурса на сервере. Например: /bishkek/ads

# https://lalafo.kg/bishkek/ads/drugie-tovary-dla-doma-id-83497518

# Запрос от клиента
# HOST lalafo.kg
# GET /bishkek/ads/ HTTPS/1.1

# Ответ от сервера
# HTTPS/1.1 200 OK

# Коды статуса ответа - определенные номера, по которым клиент определяет состояние ответа

# 1хх - информационные
# 2хх - успешные
# 3хх - перенаправление запроса
# 4хх - ошибки в запросе со стороны клиента
# 5хх - ошибка на стороне сервера


# API - Application Programming Interface - интерфейс для управления сервером
