"""  
SQL - Structured Query Language - язык структурированных запросов - язык для общения с базами данных

База данных (БД - DB) - организованная структура для хранения данных 

СУБД - Система Управления Базами Данных - программы для управления БД

БД бывают:
1) Реляционные - имеют связи между таблицами
2) Нереляционные - не имеют связей (ключ - значение)

PostgreSQL - СУБД, быстрая, масштабируемая, бесплатная, много встроенных функций, хранит данные на жестком диске

Категории запросов:
1) DDL - Data Definition Language - работа над таблицами (CREATE, ALTER, DROP)
2) DML - Data Manipulation Language - работа над данными в таблицах (SELECT, INSERT, UPDATE, DELETE)
3) TCL - Transaction Control Language - работа с транзакциями (COMMIT, ROLLBACK, SAVEPOINT...) 
"""