""" Целые числа """
# int()
int_num = 10

# float()
float_num = 10.5

# int - неизменяемый тип данных
# num1 = 20
# num1 + 50
# print(num1) 

# num1 = 20
# num1 = num1 + 50
# print(num1) 

""" Операторы для работы с числами """
10 + 10 # сложение - 20
10 - 5 # вычитание - 5
10 * 5 # умножение - 50
10 / 5 # деление - 2.0 -> float
10 // 5 # деление - 2 -> int
3 ** 3 # возведение в степень -> 3 * 3 * 3 -> 27
10 % 3 # выделение остатка -> 1

10 % 2 # 0
10 % 3 # 1

""" Функции для работы с числами """
# round()
# print(round(5.2))
# print(round(5.6))
# print(round(6.5)) # округлит в четную сторону
# print(round(5.8672348, 2)) # 5.87 - 2 знака после точки

# abs() - показывает насколько число далеко от нуля/абсолютное значение
# print(abs(5))
# print(abs(-5))
# print(abs(5.6))
# _____-5_____0_____5______

# import math
# math.sqrt(25) # 5

